src/InformationRegisters/СостоянияПроверкиДокументовИСМП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>СостоянияПроверкиДокументовИСМП</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СтатусЭДО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПодразделениеКомпании</Name>
					<Comment>Подразделение компании, в котором был выписан документ</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РезультатПроверки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДальнейшееДействие</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ДальнейшиеДействияИСМП</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЭлектронныйДокумент</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЭлектронныйДокументИсходящий</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Проверен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатусОбработки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыДокументовМаркировки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ИдентификаторЭДО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаПроверки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЭДО</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХешСумма</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗаписи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВозвратПоставщику</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваров</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторПроверки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/СостоянияПроверкиДокументовИСМП/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Функция СформироватьХешСумму(ОрганизацияИНН, КонтрагентИНН, КодыМаркируемойПродукции) Экспорт
	
	ПоляДокумента = Новый Массив;
	ПоляДокумента.Добавить(ОрганизацияИНН);
	ПоляДокумента.Добавить(КонтрагентИНН);
	Для Каждого СтрокаМарки Из КодыМаркируемойПродукции Цикл
		ПоляДокумента.Добавить(СтрокаМарки.КодМарки);
	КонецЦикла;
	
	Хеширование = Новый ХешированиеДанных(ХешФункция.SHA256);
	Хеширование.Добавить(СтрСоединить(ПоляДокумента));
	
	Результат = Base64Строка(Хеширование.ХешСумма);
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьДокументыДляПроверки(Источник) Экспорт
	
	Результат = Новый Массив;
	
	Если ТипЗнч(Источник) = Тип("Массив") Тогда
		МассивДокументов = Источник;
	Иначе
		МассивДокументов = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Источник);
	КонецЕсли;
	
	ТипыДокументов = Метаданные.РегистрыСведений.СостоянияПроверкиДокументовИСМП.Измерения.Документ.Тип;
	Для Каждого ТекущийДокумент Из МассивДокументов Цикл
		
		Если ЗначениеЗаполнено(ТекущийДокумент) 
			И ТипыДокументов.СодержитТип(ТипЗнч(ТекущийДокумент)) Тогда
			Результат.Добавить(ТекущийДокумент);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция СостоянияПроверкиДокументов(МассивДокументов, ИдентификаторыЭДО = Неопределено) Экспорт
	
	ТекстЗапроса =
		"ВЫБРАТЬ
		|	СостоянияПроверкиДокументовИСМП.СтатусЭДО          КАК СтатусЭДО,
		|	СостоянияПроверкиДокументовИСМП.Документ           КАК Документ,
		|	СостоянияПроверкиДокументовИСМП.Организация        КАК Организация,
		|	СостоянияПроверкиДокументовИСМП.ДатаНачалаПроверки КАК ДатаНачалаПроверки,
		|	СостоянияПроверкиДокументовИСМП.РезультатПроверки  КАК РезультатПроверки,
		|	СостоянияПроверкиДокументовИСМП.ИдентификаторЭДО   КАК ИдентификаторЭДО,
		|	СостоянияПроверкиДокументовИСМП.ХешСумма           КАК ХешСумма,
		|	СостоянияПроверкиДокументовИСМП.ИдентификаторПроверки КАК ИдентификаторПроверки,
		|	СостоянияПроверкиДокументовИСМП.ЭлектронныйДокумент КАК ЭлектронныйДокумент,
		|	СостоянияПроверкиДокументовИСМП.ДатаЗаписи          КАК ДатаЗаписи
		|ИЗ
		|	РегистрСведений.СостоянияПроверкиДокументовИСМП КАК СостоянияПроверкиДокументовИСМП
		|ГДЕ
		|	СостоянияПроверкиДокументовИСМП.Документ В (&МассивДокументов)
		|	И &ИдентификаторыЭДО
		|";
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивДокументов", МассивДокументов);
	Запрос.УстановитьПараметр("ИдентификаторыЭДО", ИдентификаторыЭДО);
	
	ОтборПоИд = "";
	Если ТипЗнч(ИдентификаторыЭДО) = Тип("Массив")
		И ИдентификаторыЭДО.Количество()>0 Тогда
		ОтборПоИд = " И СостоянияПроверкиДокументовИСМП.ИдентификаторЭДО В (&ИдентификаторыЭДО)";
	КонецЕсли;
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "И &ИдентификаторыЭДО", ОтборПоИд);
	
	Запрос.Текст = ТекстЗапроса;
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Результат = Новый Соответствие;
	
	Пока Выборка.Следующий() Цикл
		
		СтрокаРезультата = Новый Структура("СтатусЭДО, ДатаНачалаПроверки, РезультатПроверки, ИдентификаторЭДО, Документ, ХешСумма, ИдентификаторПроверки, ЭлектронныйДокумент, ДатаЗаписи");
		
		ЗаполнитьЗначенияСвойств(СтрокаРезультата, Выборка);
		
		Результат.Вставить(Выборка.Документ, СтрокаРезультата);
	
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Осуществляет запись в регистр по переданным данным.
//
// Параметры:
//  ДанныеЗаписи - данные для записи в регистр.
//
Процедура ВыполнитьЗапись(ДанныеЗаписи) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	МенеджерЗаписи = СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(МенеджерЗаписи, ДанныеЗаписи);
	МенеджерЗаписи.Записать();
	
КонецПроцедуры

// Осуществляет запись в регистр по переданным данным.
//
// Параметры:
//  ДанныеЗаписи - данные для записи в регистр.
//
Процедура ОбновитьЗапись(ДанныеЗаписи) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	МенеджерЗаписи = СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Документ              = ДанныеЗаписи.Документ;
	МенеджерЗаписи.ИдентификаторПроверки = ДанныеЗаписи.ИдентификаторПроверки;
	МенеджерЗаписи.Прочитать();
	ЗаполнитьЗначенияСвойств(МенеджерЗаписи, ДанныеЗаписи);
	МенеджерЗаписи.Записать();
	
КонецПроцедуры

Процедура УдалитьЗапись(Источник, ИдентификаторПроверки = Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если ТипЗнч(Источник) = Тип("Массив") Тогда
		МассивДокументов = Источник;
	Иначе
		МассивДокументов = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Источник);
	КонецЕсли;
	
	Для Каждого ТекущийДокумент Из МассивДокументов Цикл
		МенеджерЗаписи = СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Документ = ТекущийДокумент;
		Если Не ИдентификаторПроверки = Неопределено Тогда
			МенеджерЗаписи.ИдентификаторПроверки = ТекущийДокумент;
		КонецЕсли;
		МенеджерЗаписи.Удалить();
	КонецЦикла;
	
КонецПроцедуры

Процедура УдалитьЗаписьПоИдентификаторуЭДО(МассивДокументов, ИдентификаторЭДО) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	СостоянияПроверкиДокументовИСМП.Документ КАК Документ,
	|	СостоянияПроверкиДокументовИСМП.ИдентификаторПроверки КАК ИдентификаторПроверки
	|ИЗ
	|	РегистрСведений.СостоянияПроверкиДокументовИСМП КАК СостоянияПроверкиДокументовИСМП
	|ГДЕ
	|	СостоянияПроверкиДокументовИСМП.Документ В (&МассивДокументов)
	|	И СостоянияПроверкиДокументовИСМП.ИдентификаторЭДО = &ИдентификаторЭДО
	|";
	
	Запрос.УстановитьПараметр("МассивДокументов", МассивДокументов);
	Запрос.УстановитьПараметр("ИдентификаторЭДО", ИдентификаторЭДО);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		УдалитьЗапись(Выборка.Документ, Выборка.ИдентификаторПроверки);
	КонецЦикла;
	
КонецПроцедуры

#КонецЕсли
